local wk = require('which-key')
local map = vim.api.nvim_set_keymap
local opt = { noremap = true, silent = true }
vim.g.mapleader = ',' -- 指定leader键位
vim.g.maplocalleader = '-' -- 指定local leader键位

-------------------------------------------------------------------------------
--                          解决neovide不能使用mac OS系统粘贴的问题
-------------------------------------------------------------------------------
vim.g.neovide_input_use_logo = 1
map('', '<D-v>', '+p<CR>', opt)
map('!', '<D-v>', '<C-R>+', opt)
map('t', '<D-v>', '<C-R>+', opt)
map('v', '<D-v>', '<C-R>+', opt)

-------------------------------------------------------------------------------
--                          窗口调整快捷键配置
-------------------------------------------------------------------------------
map('n', '<Left>', ':winc <<CR>', opt) -- 窗口向左放大
map('n', '<Right>', ':winc ><CR>', opt) -- 窗口向右放大
map('n', '<Down>', '<C-w>+', opt) -- 窗口向上放大
map('n', '<Up>', '<C-w>-', opt) -- 窗口向下放大
map('n', '<Right>', ':winc ><CR>', opt) -- 窗口向右放大
map('n', 's=', '<C-w>=', opt) -- 窗口垂直等大

-------------------------------------------------------------------------------
--                          搜索快捷键配置
-------------------------------------------------------------------------------
-- 关闭搜索高亮
wk.register({
  ['<space>'] = {
    l = {
     ':<C-u>nohlsearch<CR>',
     'nohlsearch'
    }
  }
})

-------------------------------------------------------------------------------
--                          移动文本快捷键配置
-------------------------------------------------------------------------------
map('v', 'J', ":move '>+1<cr>gv-gv", opt) -- 向下移
map('v', 'K', ":move '<-2<cr>gv-gv", opt) -- 向上移

-------------------------------------------------------------------------------
--                          exporer 快捷键配置
-------------------------------------------------------------------------------
wk.register({
  ['<space>'] = {
    f = {
    name = "files",
      m = {
        ':CocCommand explorer --toggle --sources=file+<CR>',
        'Open explorer'
      }
    }
  }
})
